<template>
    <!-- HOME COMP [display grid with 4 boxes cross shaped] -->
    <div class="home"> 

        <div v-if="playbgm" class="jumbo absolute -inset-[10px] opacity-50"></div>

        <!-- USER -->
        <div class="user-panel">
            <div class="貴方"><span>貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方貴方方</span></div>

            <div v-if="logged" class="user-panel__online">

            </div>

            <div v-else class="user-panel__offline">

                <div v-if="!selectRegister" class="login_form">
                    <form action="" method="">
                        <input type="text" name="username" id="username" placeholder="Username" v-model="usr" required>
                        <input type="password" placeholder="Password" v-model="pw" required>
                        <button>Log:In</button>
                    </form>
                    <a v-on:click="selectRegister = true">No account yet?</a>
                </div>

                <div v-if="selectRegister" class="register_form">
                    <form action="" method="">
                        <input type="text" name="username" id="username" placeholder="Username" v-model="usr" required>
                        <input type="password" placeholder="Password" v-model="pw" required>
                        <input type="email" placeholder="E-mail" v-model="email" required>
                        <button>Re:gister</button>
                    </form>
                    <a v-on:click="selectRegister = false">Log:In instead?</a>
                </div>

                <div v-else>

                </div>

            </div>
            <div class="user-panel__menu">
                <div v-on:click="setPref(true)" class="svg-container__home settings">
                    <svg width="40px" height="40px" viewBox="0 0 24 24" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:sketch="http://www.bohemiancoding.com/sketch/ns"><title>icon/24/icon-settings</title><desc>Created with Sketch.</desc><defs></defs><g id="out" stroke="none" stroke-width="1" fill-rule="evenodd" sketch:type="MSPage"><path d="M18.1125649,13.0304195 C18.1454626,12.7672379 18.1701359,12.5040563 18.1701359,12.2244258 C18.1701359,11.9447953 18.1454626,11.6816137 18.1125649,11.4184321 L19.8479188,10.0614018 C20.0041828,9.93803541 20.045305,9.71597592 19.9466119,9.53503855 L18.3017267,6.68938723 C18.2030336,6.50844986 17.9809741,6.44265446 17.8000367,6.50844986 L15.7521547,7.33089244 C15.3244846,7.00191541 14.8639167,6.73050936 14.3622268,6.52489871 L14.0496986,4.34542588 C14.0250253,4.14803966 13.8523124,4 13.6467017,4 L10.3569314,4 C10.1513208,4 9.97860782,4.14803966 9.95393455,4.34542588 L9.64140637,6.52489871 C9.13971639,6.73050936 8.67914855,7.01013984 8.25147841,7.33089244 L6.20359639,6.50844986 C6.0144346,6.43443003 5.80059953,6.50844986 5.70190642,6.68938723 L4.05702126,9.53503855 C3.95010373,9.71597592 3.99945028,9.93803541 4.15571437,10.0614018 L5.89106821,11.4184321 C5.85817051,11.6816137 5.83349723,11.9530197 5.83349723,12.2244258 C5.83349723,12.4958318 5.85817051,12.7672379 5.89106821,13.0304195 L4.15571437,14.3874498 C3.99945028,14.5108161 3.95832815,14.7328756 4.05702126,14.913813 L5.70190642,17.7594643 C5.80059953,17.9404017 6.02265902,18.0061971 6.20359639,17.9404017 L8.25147841,17.1179591 C8.67914855,17.4469361 9.13971639,17.7183422 9.64140637,17.9239528 L9.95393455,20.1034257 C9.97860782,20.3008119 10.1513208,20.4488516 10.3569314,20.4488516 L13.6467017,20.4488516 C13.8523124,20.4488516 14.0250253,20.3008119 14.0496986,20.1034257 L14.3622268,17.9239528 C14.8639167,17.7183422 15.3244846,17.4387117 15.7521547,17.1179591 L17.8000367,17.9404017 C17.9891985,18.0144215 18.2030336,17.9404017 18.3017267,17.7594643 L19.9466119,14.913813 C20.045305,14.7328756 20.0041828,14.5108161 19.8479188,14.3874498 L18.1125649,13.0304195 L18.1125649,13.0304195 L18.1125649,13.0304195 Z M12.0018166,15.1029748 C10.4145024,15.1029748 9.12326754,13.81174 9.12326754,12.2244258 C9.12326754,10.6371116 10.4145024,9.34587676 12.0018166,9.34587676 C13.5891307,9.34587676 14.8803656,10.6371116 14.8803656,12.2244258 C14.8803656,13.81174 13.5891307,15.1029748 12.0018166,15.1029748 L12.0018166,15.1029748 L12.0018166,15.1029748 Z" id="path" fill="#000000" sketch:type="MSShapeGroup"></path></g></svg>
                </div>

                <div class="svg-container__home jkbox play" ref="play">
                    <div v-if="this.playbgm" id="colorlays"></div>
                    <svg xmlns="http://www.w3.org/2000/svg" width="50px" height="50px" viewBox="0 0 24 24"><path d="M3 11V13M6 8V16M9 10V14M12 7V17M15 4V20M18 9V15M21 11V13" stroke="#000000" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/></svg>
                    <audio loop id="jukebox" ref="jukebox">
                        <source src="../assets/kmb.ogg" type="audio/ogg"> 
                    </audio>
                </div>
            </div>
        </div>

        <!-- DAILIES -->
        <div class="daily-panel">
            <div class="日常"><span>常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日常日常日日常日常日常日常日常日常日常日常日常日常日</span></div>
            
            <div v-if="logged" class="daily-panel__online">

            </div>

            <div v-else class="daily-panel__offline">
                <div class="daily__offline">Log:In to see your daily words <span class="bango"></span></div>
            </div>
        </div>


        <!-- GODLE -->
        <div class="godle-panel">
            <div class="語ドル"><span>語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語ドル語</span></div>
            
            <div class="godle-panel__container">
                <div class="godle-title"><span style="color: rgb(255, 170, 0);">語</span><span style="color: rgb(51, 187, 255);">ドル</span></div>
                <div class="streak">Streak: {{ godleStreak }}</div>

                <div v-if="doneGodle" class="goddle-panel__done">
                
                </div>

                <div v-else class="godle-panel__not-done">
                    <span>new word available!</span>
                    <div class="last-word-page">
                        
                    </div>
                    <div class="doneGodle__link">
                        <a href="/godle">Guess the word!</a>
                    </div>
                </div>
            </div>
        </div>

        <!-- LIBRARY -->
        
        <div class="library-panel">
            <div class="書斎"><span>書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎書斎</span></div>
            <div class="library-panel__link">
            </div>
        </div>

        <div v-if="showPref" id="preferences-wrapper">
            <div id="preferences">
                <h1>Preferences</h1>
                <div id="preflist">
                    <div class="preference" id="preference_forceintro">
                        <div class="explanation">
                            <span class="explanation__h2">Always play intro</span>
                            <span class="explanation__p">Off</span>
                        </div>
                        <div class="switch">
                            <input type="checkbox" name="toggle" :checked="prefIntro" @change="pref_intro_toggle">
                            <label for="toggle"><i></i></label>
                            <span></span>
                        </div>
                    </div>
                    <div class="preference" id="preference_animations">
                        <div class="explanation">
                            <span class="explanation__h2">Scanlines</span>
                            <span class="explanation__p">Use scanlines</span>
                        </div>
                        <div class="switch">
                            <input type="checkbox" name="toggle" :checked="prefScan" @change="pref_scan_toggle">
                            <label for="toggle"><i></i></label>
                            <span></span>
                        </div>
                    </div>
                    <div class="preference" id="scanlines_opacity">
                        <div class="explanation">
                            <span class="explanation__h2">Scanline opacity</span>
                            <span class="explanation__p">50%</span>
                        </div>
                        <input type="range" min="5" max="100" value="50" class="slider">
                    </div>
                    <div class="preference" id="music_volume">
                        <div class="explanation">
                            <span class="explanation__h2">Music volume</span>
                            <span class="explanation__p">100%</span>
                        </div>
                        <input type="range" min="0" max="100" value="100" class="slider">
                    </div>
                    <div class="preference" id="preference_you">
                        <div class="explanation">
                            <span class="explanation__h2">Being great</span>
                            <span class="explanation__p">Thank you for being you</span>
                        </div>
                        <div class="switch">
                            <input type="checkbox" name="toggle" :checked="true" :disabled="true">
                            <label v-link for="toggle"><i></i></label>
                            <span></span>
                        </div>
                    </div>
                </div>
                <div v-on:click="setPref(false)" id="preferences-close" class="cur-confirm">CLOSE</div>
            </div>
        </div>



    </div>

    
    
</template>

<script>

/*      TODO

    updateScanlines slider :dies: maybe just change opacity directly inside the css inside the html element ?? with some vue magic dunno



*/

import axios from 'axios'
import Cookies from 'js-cookie'


export default {
    name: "LeHome",
    data() {
        return {
            word: "",
            selectRegister: false,
            usr: '',
            pw: '',
            email: '',
            doneGodle: null,
            playbgm: false,
            showPref: false,
            prefScan: true,
            prefIntro: true,
            prefSlopac : 0.75,
            godleStreak: 0
        }
    },

    mounted() {
        this.initAudio()
        this.initCookies()
        this.updateScanlinesOF()
    },

    methods: {
        async initPage() {
            try {
                const resp = await axios.get('http://localhost:3000/word')
                this.word = resp.data.word
            } catch (e) {
                console.error('fetching fail : ', e)
            }
        },
        initAudio() {

            this.$refs.jukebox.volume = 0.1

            const playAudio = () => {
                this.playbgm = true
                this.$refs.jukebox.play()
                this.$refs.play.classList.replace("play","pause")
            }

            const pauseAudio = () => {
                this.playbgm = false
                this.$refs.jukebox.pause()
                this.$refs.play.classList.replace("pause","play")
            }

            this.$refs.play.addEventListener("click", () => {
                this.playbgm ? pauseAudio() : playAudio();
            })
        },
        initCookies(){
            if(Cookies.get("pref-scan") !== null){
                this.prefScan = Cookies.get("pref-scan") === 'true'
            }
            if(Cookies.get("pref-intro") !== null){
                this.prefIntro = Cookies.get("pref-intro") === 'true'
            }   
            if(Cookies.get("pref-slopac") !== null){
                this.prefSlopac = parseFloat(Cookies.get("pref-slopac"))
            }             
        },
        setPref(p){
            this.showPref = p
        },
        pref_scan_toggle(){
            console.log(event.target.checked)
            Cookies.set('pref-scan', event.target.checked.toString(), Date.now() + (365*24*60*60*1000))
            this.prefScan = event.target.checked
            this.updateScanlinesOF()
        },
        pref_intro_toggle(){
            Cookies.set('pref-intro', event.target.checked.toString(), Date.now() + (365*24*60*60*1000))
            this.prefIntro = event.target.checked
            this.forceIntro()
        },
        pref_scan_slider(){
            Cookies.set("pref-slopac", (event.target.value / 100).toString(), Date.now() + (365*24*60*60*1000));
            this.prefSlopac = event.target.value / 100
            this.updateScanlines()
        },
        forceIntro(){
            if(this.forceIntro){
                return
            }
        },
        updateScanlinesOF(){
            
            switch (this.prefScan) {
                case true:
                    /*if (("#animations-none.selected").length){
                        $("#animations-none").removeClass("selected")
                    }
                    $("#animations-all").addClass("selected")*/
                    document.documentElement.classList.remove('no-anim');
                    document.documentElement.classList.remove('no-scanlines');
                   
                    break
                case false:
                    /*if (("#animations-all.selected").length){
                        $("#animations-all").removeClass("selected")
                    }*/
                    document.documentElement.classList.add('no-anim');
                    document.documentElement.classList.add('no-scanlines');
                   
                    break
                default:
                    /*$("#animations-all").addClass("selected")*/
                    break
            }
        },
        updateScanlines(){
            /*setPseudo("html:not(.no-scanlines):not(.force-no-scanlines) body::before", "opacity", this.prefSlopac);*/
            return
        }
    }

}

</script>

<style>

:root {
	--main-bg: hsl(240, 27%, 6%);
    --color: hsla(0, 0%, 0%, 0.815);
    --inverse-color:hsl(0, 0%, 100%);
}


@keyframes jumbo {
    from {
        background-position: 50% 50%, 50% 50%;
    }
    to {
        background-position: 350% 50%, 350% 50%;
    }
}

@keyframes scroletxt {
    0% {
    transform: translate3d(0, 0, 0);
  }
  100% {
    transform: translate3d(-30%, 0, 0);
  }
}

@keyframes invscroletxt {
    0% {
    transform: translate3d(0, 0, 0);
  }
  100% {
    transform: translate3d(30%, 0, 0);
  }
}

@keyframes lights {
    0% {
        color: #b8bee0;
        text-shadow: 0 0 1em rgba(255,0,170,.2),0 0 .125em rgba(255,51,187,.3),-1em -.125em .5em rgba(255,187,51,0),1em .125em .5em rgba(51,187,255,0)
    }

    30% {
        color: #d1d8fa;
        text-shadow: 0 0 1em rgba(255,0,170,.5),0 0 .125em rgba(255,51,187,.5),-.5em -.125em .25em rgba(255,187,51,.2),.5em .125em .25em rgba(51,187,255,.4)
    }

    40% {
        color: #e6eaff;
        text-shadow: 0 0 1em rgba(255,0,170,.5),0 0 .125em rgba(255,204,238,.5),-.25em -.125em .125em rgba(255,187,51,.2),.25em .125em .125em rgba(51,187,255,.4)
    }

    70% {
        color: #d1d8fa;
        text-shadow: 0 0 1em rgba(255,0,170,.5),0 0 .125em rgba(255,51,187,.5),.5em -.125em .25em rgba(255,187,51,.2),-.5em .125em .25em rgba(51,187,255,.4)
    }

    to {
        color: #b8bee0;
        text-shadow: 0 0 1em rgba(255,0,170,.2),0 0 .125em rgba(255,51,187,.3),1em -.125em .5em rgba(255,187,51,0),-1em .125em .5em rgba(51,187,255,0)
    }
}

.jumbo { 

    /* @actualTimWilson */

    --stripesDark: repeating-linear-gradient(
        100deg,
        #000 0%,
        #000 7%,
        transparent 10%,
        transparent 12%,
        #000 16%
    );
    --rainbow: repeating-linear-gradient(
        100deg,
        #60a5fa 10%,
        #e879f9 15%,
        #60a5fa 20%,
        #5eead4 25%,
        #60a5fa 30%
    );
    position: absolute;
    width: 100%;
    height: 100%;
    top:0;
    right: 0;
    opacity: 0.5;
    z-index: 22;
    
    background-image: var(--stripesDark), var(--rainbow);
    background-size: 300%, 200%;
    background-position: 50% 50%, 50% 50%; /* change to a transform for prod */

    filter: blur(10px) opacity(50%) saturate(200%);

    mask-image: radial-gradient(ellipse at 100% 0%, black 40%, transparent 70%);

    pointer-events: none;
}

.jumbo::after {
    content: "";
    position: absolute;
    inset: 0;
    background-image: var(--stripesDark), var(--rainbow);
    background-size: 200%, 100%;
    animation: jumbo 60s linear infinite;
    background-attachment: fixed;
    mix-blend-mode: difference;
}


.home {
    width: 100%;
    height: 100%;
    position: relative;

    display: grid;
    grid-template-columns: repeat(2, 1fr);
    grid-template-rows: repeat(2, 1fr);
}


.svg-container__home {
    height: 3.5vh;
    width: 3vw;
    position: relative;
}

.svg-container__home svg{
  position: absolute;
  cursor: pointer;
  width: 100%;
  height: 100%;
  fill: #fff;
}

.settings {
    border: solid 2px #000;
    background-color: #fff;
}

.jkbox {
    border: solid 2px white;
    background-color: #fff;
    position: relative;
    overflow: hidden;
    cursor: pointer;
}


#colorlays {
  position: absolute;
  left: 0;
  top: 0;
  right: -600%;
  bottom: 0;
  z-index: 10;
  background: linear-gradient(to right, #00DEFF 0%, #00FF72 20%, #0066FF 40%, #00FFF6 60%, #3000FF 80%, #00DEFF 100%);
  background-size: 50% 100%;
  mix-blend-mode: multiply;
  pointer-events: none;
  transform: translateX(0);
  animation: 10s scrole linear infinite;
  opacity: 0.5;
}



.user-panel, .daily-panel, .godle-panel, .library-panel {
    background: var(--main-bg);
    border: 0.05vw solid transparent;
    overflow: hidden;
    transition: 0.3s linear;
}

.user-panel:hover , .daily-panel:hover , .godle-panel:hover , .library-panel:hover {
    border: 0.05vw solid #ff0000;
}

/* 
 *                                            USER PANEL 
 */

.user-panel {
    grid-row: 1;
    grid-column: 1;
    position: relative;
}

.user-panel:hover {
    background: url(../assets/psy5.gif) no-repeat;
    background-size: cover;
}

.user-panel:hover .login_form, .register_form{
    backdrop-filter: blur(30px);
}

.user-panel__menu {
    position: absolute;
    top:0;
    right:0;
    display: flex;
    flex-direction: column;
    gap: 0.5vh;
}

.user-panel__offline,
.user-panel__online {
    max-width: fit-content;
    margin-top: 2vh;
    margin-inline: auto;
}

.login_form,
.register_form{
    background: hsla(0, 0%, 0%, 0.5);
    position: relative;
    padding: 0.5vw;
    z-index: 1;
    transition: 0.15s linear;
}

.login_form a,
.register_form a{
    color: #fff;
    cursor: pointer;
    font-family: 'square';
}

.user-panel__offline input {
    background: #222;
    background: linear-gradient(#333, #222);	
    border: 1px solid #444;
    color: #888;
    display: block; 
    font-family: 'square';
    font-size: 13px;
    font-size: 1.3rem;
    margin: 20px auto 10px; 
    padding: 0 10px;
    text-shadow: 0 -1px 0 #000;
  }


.user-panel__offline input:focus {
    background: #0B4252;
    background: linear-gradient(#333933, #222922);
    border-color: #00fffc;
    box-shadow: 0 0 5px rgba(0, 255, 253, .2), inset 0 0 5px rgba(0, 255, 253, .1), 0 2px 0 #000;
    color: #efe;
    outline: none;
}





.user-panel__offline button { 
    background: #222;
    background: linear-gradient(#333, #222);
    border: 1px solid #444;
    color: #fff;
    display: block;
    font-family: 'square';
    font-size: 1.2rem;
    font-weight: 400;
    height: 4vh;
    margin-top: 2vh;
    position: relative;
    text-shadow: 0 -1px 0 #000;
    width: 20vw;
}	

.user-panel__offline button:hover,
.user-panel__offline button:focus {
    background: #0C6125;
    background: linear-gradient(#393939, #292929);
    color: #00fffc;
    outline: none;
    transition: 1s all ;
}

.user-panel__offline button:active {
    background: #292929;
    background: linear-gradient(#393939, #292929);
    box-shadow: 0 1px 0 #000, inset 1px 0 1px #222;
    top: 1px; 
}



/* prefs */

::-webkit-scrollbar {
  width: 0.2em;
}
 
::-webkit-scrollbar-track {
  box-shadow: inset 0 0 6px rgba(0, 0, 0, 0.3);
}
 
::-webkit-scrollbar-thumb {
  background-color: #000;
  outline: 1px solid #518EE2;;
}

#preferences-wrapper {
    background-color: rgba(0, 0, 0, 0.8);
    transition: 0.3s background-color;
    position: absolute;
    left: 0; 
    right: 0; 
    margin-left: auto; 
    margin-right: auto; 
    width: 60%;
    height: 100%;
    z-index: 5000000;
}

#preferences-wrapper.hidden {
    background-color: rgba(0, 0, 0, 0);
    pointer-events: none;
}

#preferences {
    padding: 1em;
    background-color: #000;
    border: 1px solid var(--inverse-color);
    color: var(--inverse-color);
    transition: 0.3s top, 0.3s transform, 0.3s opacity;
}

#preferences-wrapper.hidden #preferences {
    top: 100%;
    opacity: 0;
    transform: translate(-50%, 0) rotate(2deg);
}

#preflist {
    overflow-y: auto;
    max-height: 43vh;
}

#preferences h1 {
    font-family: "CNT", sans-serif;
    font-size: 1.3vw;
    border-bottom: 1px solid var(--inverse-color);
    padding-bottom: 0.25em;
}

#preferences-close {
    color: #000;
    text-align: center;
    font-family: "Heading", sans-serif;
    font-size: 2em;
    margin: -0.5em;
    margin-top: 0.5em;
    background-color: var(--inverse-color);
    padding: 0.25em;
    text-decoration: none;
    cursor: pointer;
}

.preference {
    padding: 0.5em;
    display: inline-block;
    width: calc(100% - 1em);
    vertical-align: middle;

    transition: 0.3s filter, 0.3s opacity;
}

.preference.disabled {
    filter: grayscale(100%);
    opacity: 0.5;
}

.preference>* {
    display: inline-block;
    float: right;
}

.preference.disabled>* {
    pointer-events: none;
}

.preference>.explanation {
    float: left;
    display: inline-flex;
    flex-direction: column;
    gap: 1vh;
}

.explanation__h2 {
    font-family: "mono", sans-serif;
    font-size: 1.5vw;
}

.explanation__p {
    font-family: "zen", sans-serif;
    margin-bottom: -0.2em;
    font-size: 0.8vw;
}

.preferences-link {
    border-bottom: 1px solid var(--inverse-color);
    margin-left: 0.5em;
    display: inline;
    font-family: "Tiny", sans-serif;
}


.switch input {
  top: 0; 
  right: 0; 
  bottom: 0; 
  left: 0;
  -ms-filter:"progid:DXImageTransform.Microsoft.Alpha(Opacity=0)";
  filter: alpha(opacity=0);
  -moz-opacity: 0;
  opacity: 0;
  z-index: 100;
  position: absolute;
  width: 100%;
  height: 100%;
  cursor: pointer;
}


.switch {
	width: 5vw;
	height: 2vh;
	position: relative;
    margin-top: 2vh;
}

.switch label {
	display: block;
	width: 80%;
	height: 100%;
	position: relative;
	background: #1F2736; /*#121823*/
    background: linear-gradient(#121823, #161d2b);
	
	box-shadow:
        inset 0 3px 8px 1px rgba(0,0,0,0.5),
        inset 0 1px 0 rgba(0,0,0,0.5),
        0 1px 0 rgba(255,255,255,0.2);
		-webkit-transition: all .5s ease;
    transition: all .5s ease;

}

.switch input ~ label i {
    display: block;
    height: 1.65vh;
    width: 1.4vw;
    position: absolute;
    left: 2px;
    top: 2px;
    z-index: 2;
    border-radius: inherit;
    background: #283446; /* Fallback */
    background: linear-gradient(#36455b, #283446);
    box-shadow:
        inset 0 1px 0 rgba(255,255,255,0.2),
        0 0 8px rgba(0,0,0,0.3),
        0 12px 12px rgba(0,0,0,0.4);
	-webkit-transition: all .5s ease;
    transition: all .5s ease;
}


.switch label + span {
	content: "";
	display: inline-block;
	position: absolute;
	right: -1px;
	top: 3px;
	width: 18px;
	height: 18px;
	border-radius: 10px;
	background: #283446; 
    background: gradient-gradient(#36455b, #283446);
	transition: all .5s ease;
	z-index: 2;
}

 /* Toggle */
.switch input:checked ~ label + span { 
	content: "";
	display: inline-block;
	position: absolute;
	width: 18px;
	height: 18px;
	border-radius: 10px;
	-webkit-transition: all .5s ease;
	transition: all .5s ease;
	z-index: 2;
	background: #b9f3fe; 
    background: gradient-gradient(#ffffff, #77a1b9);
    box-shadow:        
		inset 0 1px 0 rgba(0,0,0,0.1),
		0 1px 0 rgba(255,255,255,0.1),
		0 0 10px rgba(100,231,253,1),
		inset 0 0 8px rgba( 61,157,247,0.8),
        inset 0 -2px 5px rgba(185,231,253,0.3),
        inset 0 -3px 8px rgba(185,231,253,0.5);
 }

.switch input:checked ~ label i {
    left: auto;
    left: 63%;
	box-shadow:
        inset 0 1px 0 rgba(255,255,255,0.2),
        0 0 8px rgba(0,0,0,0.3),
        0 8px 8px rgba(0,0,0,0.3),
		inset -1px 0 1px #b9f3fe;
	-webkit-transition: all .5s ease;
    transition: all .5s ease;
}
 


.slider {
    --color: var(--inverse-color);
    -webkit-appearance: none;
    border: 1px solid var(--color);
    width: 10em;
    height: 1px;
    background-color: #000;
    outline: none;
    padding: 0;
    margin-top: 3vh;
    margin-right: 0;
}

.slider::-webkit-slider-thumb {
    -webkit-appearance: none;
    width: 16px;
    height: 16px;
    background: var(--color);
    border: none;
    border-radius: 0px;
}

.slider::-moz-range-thumb {
    width: 16px;
    height: 16px;
    background: var(--color);
    border: none;
    border-radius: 0px;
}

.slider::-webkit-slider-runnable-track {
    opacity: 1;
    cursor: pointer;
}

.slider::-moz-range-track {
    opacity: 0;
}

/* DAILY PANEL */

.daily-panel {
    grid-row: 1;
    grid-column: 2;
    position: relative;
    overflow: hidden;
}

.daily-panel:hover {
    background: url(../assets/psy6.gif) no-repeat;
    background-size: cover;
}

.daily-panel:hover .daily__offline {
    backdrop-filter: blur(30px);
}


.daily-panel__offline {
    width: 100%;
    height: 100%;
    display: flex;
    justify-content: center;
    align-items: center;
    text-align: center;
}

.daily__offline {
    color: #fff;
    position: relative;
    background: hsla(0, 0%, 0%, 0.5);
    padding: 2vw;
    z-index: 1;
    display: flex;
    justify-content: center;
    align-items: center;
    font-family: 'square';
    line-height: 2;
}

.日常,
.貴方{
    position: absolute;
    left: -100%;
    width: 100vw;
    color: white;
    pointer-events: none;
    text-shadow: 0 0 1px black;
    font-size: 15px; /* Adjust font size as needed */
    animation: 20s scroletxt linear infinite;
    opacity: 0.1;
    z-index: 1;
}

.語ドル,
.書斎 {
    position: absolute;
    right: -100%;
    width: 100vw;
    color: white;
    pointer-events: none;
    text-shadow: 0 0 1px black;
    font-size: 15px; /* Adjust font size as needed */
    animation: 20s invscroletxt linear infinite;
    opacity: 0.1;
    z-index: 1;
}


.bango {
    background: url(../assets/2x.webp) no-repeat center;
    background-size: cover;
    margin-left: 1vw;
    width: 2vw;
    height: 3vh;
    z-index: 45;
}

/* GODLE PANEL */

.godle-panel {
    grid-row: 2;
    grid-column: 1;
    position: relative;
    overflow: hidden;
    display: flex;
    justify-content: center;
    align-items: center;
}

.godle-panel:hover {
    background: url(../assets/psy1.gif) no-repeat;
    background-size: cover;
}

.godle-title {
    font-size: 2em;
    font-family: 'yasashisa';
    font-weight: 300;
    animation: lights 5s linear .75s infinite;
}

.godle-panel:hover .godle-panel__container{
    backdrop-filter: blur(30px);
}

.godle-panel__container {
    position: relative;
    text-align: center;
    padding-inline: 6vw;
    padding-top: 4vh;
    padding-bottom: 4vh;
    background: hsla(0, 0%, 0%, 0.5);
    z-index: 1;
}

.godle-panel__not-done span{
    position: absolute;
    top:0.5vw;
    left:0.5vw;
    color: #ff0000;
    font-family: 'square';
    font-size: 0.7em;
}

.doneGodle__link {
    color: #fff;
    font-family: 'square';
    line-height: 2;
}

.doneGodle__link a{
    color: #fff;
    text-decoration: none;
}

.streak {
    position: absolute;
    top:0;
    right: 0;
    color: #fff;
    font-family: 'square';
    line-height: 2;
    font-size: 0.8rem;
    padding: 0.5vw;   
}

/* LIB PANEL */

.library-panel {
    grid-row: 2;
    grid-column: 2;
    position: relative;
    overflow: hidden;
}

.library-panel:hover {
    background: url(../assets/psy1.gif) no-repeat;
    background-size: cover;
}


</style>